garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1776.PIC
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x30F"/>
        <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x311"/>
        <edc:SFRDef edc:access="n-rn---n" edc:cname="MD1CON0" edc:desc="" edc:impl="0xb1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00---0" edc:name="MD1CON0" edc:nzwidth="8" edc:por="0-00---0" edc:_modsrc="DOS-02566_txm_mod_v3_F177x.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x315">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BIT" edc:desc="" edc:mask="0x1" edc:name="BIT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="OPOL" edc:desc="" edc:mask="0x1" edc:name="OPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD1BIT" edc:desc="" edc:mask="0x1" edc:name="MD1BIT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MD1OPOL" edc:desc="" edc:mask="0x1" edc:name="MD1OPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1OUT" edc:desc="" edc:mask="0x1" edc:name="MD1OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MD1EN" edc:desc="" edc:mask="0x1" edc:name="MD1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn--nn" edc:cname="MD1CON1" edc:desc="" edc:impl="0x33" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00--00" edc:name="MD1CON1" edc:nzwidth="8" edc:por="--00--00" edc:_modsrc="DOS-02566_txm_mod_v3_F177x.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x316">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLSYNC" edc:desc="" edc:mask="0x1" edc:name="CLSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLPOL" edc:desc="" edc:mask="0x1" edc:name="CLPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CHSYNC" edc:desc="" edc:mask="0x1" edc:name="CHSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHPOL" edc:desc="" edc:mask="0x1" edc:name="CHPOL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD1CLSYNC" edc:desc="" edc:mask="0x1" edc:name="MD1CLSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1CLPOL" edc:desc="" edc:mask="0x1" edc:name="MD1CLPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MD1CHSYNC" edc:desc="" edc:mask="0x1" edc:name="MD1CHSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1CHPOL" edc:desc="" edc:mask="0x1" edc:name="MD1CHPOL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="MD1SRC" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="MD1SRC" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02566_txm_mod_v3_F177x.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x317">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MS" edc:desc="" edc:mask="0x1f" edc:name="MS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="MS0" edc:desc="" edc:mask="0x1" edc:name="MS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MS1" edc:desc="" edc:mask="0x1" edc:name="MS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MS2" edc:desc="" edc:mask="0x1" edc:name="MS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MS3" edc:desc="" edc:mask="0x1" edc:name="MS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MS4" edc:desc="" edc:mask="0x1" edc:name="MS4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD1MS" edc:desc="" edc:mask="0x1f" edc:name="MD1MS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MD1MS0" edc:desc="" edc:mask="0x1" edc:name="MD1MS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1MS1" edc:desc="" edc:mask="0x1" edc:name="MD1MS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1MS2" edc:desc="" edc:mask="0x1" edc:name="MD1MS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1MS3" edc:desc="" edc:mask="0x1" edc:name="MD1MS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1MS4" edc:desc="" edc:mask="0x1" edc:name="MD1MS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="MD1CARL" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---x0000" edc:name="MD1CARL" edc:nzwidth="8" edc:por="---x0000" edc:_modsrc="DOS-02566_txm_mod_v3_F177x.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x318">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CL" edc:desc="" edc:mask="0x1f" edc:name="CL" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CL0" edc:desc="" edc:mask="0x1" edc:name="CL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CL1" edc:desc="" edc:mask="0x1" edc:name="CL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CL2" edc:desc="" edc:mask="0x1" edc:name="CL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CL3" edc:desc="" edc:mask="0x1" edc:name="CL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CL4" edc:desc="" edc:mask="0x1" edc:name="CL4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD1CL" edc:desc="" edc:mask="0x1f" edc:name="MD1CL" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MD1CL0" edc:desc="" edc:mask="0x1" edc:name="MD1CL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1CL1" edc:desc="" edc:mask="0x1" edc:name="MD1CL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1CL2" edc:desc="" edc:mask="0x1" edc:name="MD1CL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1CL3" edc:desc="" edc:mask="0x1" edc:name="MD1CL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1CL4" edc:mask="0x1" edc:name="MD1CL4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="MD1CARH" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---x0000" edc:name="MD1CARH" edc:nzwidth="8" edc:por="---x0000" edc:_modsrc="DOS-02566_txm_mod_v3_F177x.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x319">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CH" edc:desc="" edc:mask="0x1f" edc:name="CH" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CH0" edc:desc="" edc:mask="0x1" edc:name="CH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH1" edc:desc="" edc:mask="0x1" edc:name="CH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH2" edc:desc="" edc:mask="0x1" edc:name="CH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH3" edc:desc="" edc:mask="0x1" edc:name="CH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CH4" edc:desc="" edc:mask="0x1" edc:name="CH4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MD1CH" edc:desc="" edc:mask="0x1f" edc:name="MD1CH" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MD1CH0" edc:desc="" edc:mask="0x1" edc:name="MD1CH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1CH1" edc:desc="" edc:mask="0x1" edc:name="MD1CH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1CH2" edc:desc="" edc:mask="0x1" edc:name="MD1CH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1CH3" edc:desc="" edc:mask="0x1" edc:name="MD1CH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1CH4" edc:mask="0x1" edc:name="MD1CH4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
