garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1776.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG2PHF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG2PHF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x70E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PHF" edc:desc="" edc:mask="0x3f" edc:name="PHF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="PHF0" edc:desc="" edc:mask="0x1" edc:name="PHF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF1" edc:desc="" edc:mask="0x1" edc:name="PHF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF2" edc:desc="" edc:mask="0x1" edc:name="PHF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF3" edc:desc="" edc:mask="0x1" edc:name="PHF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF4" edc:desc="" edc:mask="0x1" edc:name="PHF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF5" edc:desc="" edc:mask="0x1" edc:name="PHF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G2PHF0" edc:desc="" edc:mask="0x1" edc:name="G2PHF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2PHF1" edc:desc="" edc:mask="0x1" edc:name="G2PHF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2PHF2" edc:desc="" edc:mask="0x1" edc:name="G2PHF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2PHF3" edc:desc="" edc:mask="0x1" edc:name="G2PHF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2PHF4" edc:desc="" edc:mask="0x1" edc:name="G2PHF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2PHF5" edc:desc="" edc:mask="0x1" edc:name="G2PHF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG2BLKR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG2BLKR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x70F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BLKR" edc:desc="" edc:mask="0x3f" edc:name="BLKR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="BLKR0" edc:desc="" edc:mask="0x1" edc:name="BLKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR1" edc:desc="" edc:mask="0x1" edc:name="BLKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR2" edc:desc="" edc:mask="0x1" edc:name="BLKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR3" edc:desc="" edc:mask="0x1" edc:name="BLKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR4" edc:desc="" edc:mask="0x1" edc:name="BLKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR5" edc:desc="" edc:mask="0x1" edc:name="BLKR5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G2BLKR0" edc:desc="" edc:mask="0x1" edc:name="G2BLKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2BLKR1" edc:desc="" edc:mask="0x1" edc:name="G2BLKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2BLKR2" edc:desc="" edc:mask="0x1" edc:name="G2BLKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2BLKR3" edc:desc="" edc:mask="0x1" edc:name="G2BLKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2BLKR4" edc:desc="" edc:mask="0x1" edc:name="G2BLKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2BLKR5" edc:desc="" edc:mask="0x1" edc:name="G2BLKR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG2BLKF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG2BLKF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x710">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BLKF" edc:desc="" edc:mask="0x3f" edc:name="BLKF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="BLKF0" edc:desc="" edc:mask="0x1" edc:name="BLKF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF1" edc:desc="" edc:mask="0x1" edc:name="BLKF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF2" edc:desc="" edc:mask="0x1" edc:name="BLKF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF3" edc:desc="" edc:mask="0x1" edc:name="BLKF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF4" edc:desc="" edc:mask="0x1" edc:name="BLKF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF5" edc:desc="" edc:mask="0x1" edc:name="BLKF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G2BLKF0" edc:desc="" edc:mask="0x1" edc:name="G2BLKF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2BLKF1" edc:desc="" edc:mask="0x1" edc:name="G2BLKF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2BLKF2" edc:desc="" edc:mask="0x1" edc:name="G2BLKF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2BLKF3" edc:desc="" edc:mask="0x1" edc:name="G2BLKF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2BLKF4" edc:desc="" edc:mask="0x1" edc:name="G2BLKF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2BLKF5" edc:desc="" edc:mask="0x1" edc:name="G2BLKF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
