garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1776.PIC
        <edc:SFRDef edc:access="----nnnn" edc:cname="PRG2INS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PRG2INS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x796">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INS" edc:desc="" edc:mask="0xf" edc:name="INS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="INS0" edc:desc="" edc:mask="0x1" edc:name="INS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INS1" edc:desc="" edc:mask="0x1" edc:name="INS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INS2" edc:desc="" edc:mask="0x1" edc:name="INS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INS3" edc:desc="" edc:mask="0x1" edc:name="INS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG2INS0" edc:desc="" edc:mask="0x1" edc:name="RG2INS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG2INS1" edc:desc="" edc:mask="0x1" edc:name="RG2INS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG2INS2" edc:desc="" edc:mask="0x1" edc:name="RG2INS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG2INS3" edc:desc="" edc:mask="0x1" edc:name="RG2INS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nnnnnn" edc:cname="PRG2CON0" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="PRG2CON0" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x797">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GO" edc:desc="" edc:mask="0x1" edc:name="GO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OS" edc:desc="" edc:mask="0x1" edc:name="OS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="REDG" edc:desc="" edc:mask="0x1" edc:name="REDG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FEDG" edc:desc="" edc:mask="0x1" edc:name="FEDG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG2GO" edc:desc="" edc:mask="0x1" edc:name="RG2GO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG2OS" edc:desc="" edc:mask="0x1" edc:name="RG2OS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG2MODE" edc:desc="" edc:mask="0x3" edc:name="RG2MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="RG2REDG" edc:desc="" edc:mask="0x1" edc:name="RG2REDG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG2FEDG" edc:desc="" edc:mask="0x1" edc:name="RG2FEDG" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RG2EN" edc:desc="" edc:mask="0x1" edc:name="RG2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RG2MODE0" edc:desc="" edc:mask="0x1" edc:name="RG2MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG2MODE1" edc:desc="" edc:mask="0x1" edc:name="RG2MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----rnn" edc:cname="PRG2CON1" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PRG2CON1" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x798">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RPOL" edc:desc="" edc:mask="0x1" edc:name="RPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FPOL" edc:desc="" edc:mask="0x1" edc:name="FPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDY" edc:desc="" edc:mask="0x1" edc:name="RDY" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG2RPOL" edc:desc="" edc:mask="0x1" edc:name="RG2RPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG2FPOL" edc:desc="" edc:mask="0x1" edc:name="RG2FPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG2RDY" edc:desc="" edc:mask="0x1" edc:name="RG2RDY" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PRG2CON2" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="PRG2CON2" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02715_amp_sloperamp_ctrl_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x799">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ISET" edc:desc="" edc:mask="0x1f" edc:name="ISET" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="ISET0" edc:desc="" edc:mask="0x1" edc:name="ISET0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET1" edc:desc="" edc:mask="0x1" edc:name="ISET1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET2" edc:desc="" edc:mask="0x1" edc:name="ISET2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET3" edc:desc="" edc:mask="0x1" edc:name="ISET3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ISET4" edc:desc="" edc:mask="0x1" edc:name="ISET4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RG2ISET" edc:desc="" edc:mask="0x1f" edc:name="RG2ISET" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="RG2ISET0" edc:desc="" edc:mask="0x1" edc:name="RG2ISET0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG2ISET1" edc:desc="" edc:mask="0x1" edc:name="RG2ISET1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG2ISET2" edc:desc="" edc:mask="0x1" edc:name="RG2ISET2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG2ISET3" edc:desc="" edc:mask="0x1" edc:name="RG2ISET3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RG2ISET4" edc:desc="" edc:mask="0x1" edc:name="RG2ISET4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
