garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1776.PIC
        <edc:SFRDef edc:access="----nnnn" edc:cname="PWM11INTE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWM11INTE" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDBC">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PWM11INTCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRIE" edc:desc="" edc:mask="0x1" edc:name="PRIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DCIE" edc:desc="" edc:mask="0x1" edc:name="DCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHIE" edc:desc="" edc:mask="0x1" edc:name="PHIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFIE" edc:desc="" edc:mask="0x1" edc:name="OFIE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM11PRIE" edc:desc="" edc:mask="0x1" edc:name="PWM11PRIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM11DCIE" edc:desc="" edc:mask="0x1" edc:name="PWM11DCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM11PHIE" edc:desc="" edc:mask="0x1" edc:name="PWM11PHIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM11OFIE" edc:desc="" edc:mask="0x1" edc:name="PWM11OFIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----cccc" edc:cname="PWM11INTF" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWM11INTF" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDBD">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PWM11INTFLG"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRIF" edc:desc="" edc:mask="0x1" edc:name="PRIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DCIF" edc:desc="" edc:mask="0x1" edc:name="DCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHIF" edc:desc="" edc:mask="0x1" edc:name="PHIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFIF" edc:desc="" edc:mask="0x1" edc:name="OFIF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM11PRIF" edc:desc="" edc:mask="0x1" edc:name="PWM11PRIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM11DCIF" edc:desc="" edc:mask="0x1" edc:name="PWM11DCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM11PHIF" edc:desc="" edc:mask="0x1" edc:name="PWM11PHIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM11OFIF" edc:desc="" edc:mask="0x1" edc:name="PWM11OFIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn--nn" edc:cname="PWM11CLKCON" edc:desc="" edc:impl="0x73" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000--00" edc:name="PWM11CLKCON" edc:nzwidth="8" edc:por="-000--00" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDBE">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x3" edc:name="CS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PS" edc:desc="" edc:mask="0x7" edc:name="PS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM11CS0" edc:desc="" edc:mask="0x1" edc:name="PWM11CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM11CS1" edc:desc="" edc:mask="0x1" edc:name="PWM11CS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM11CS2" edc:desc="" edc:mask="0x1" edc:name="PWM11CS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM11PS0" edc:desc="" edc:mask="0x1" edc:name="PWM11PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM11PS1" edc:desc="" edc:mask="0x1" edc:name="PWM11PS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM11PS2" edc:desc="" edc:mask="0x1" edc:name="PWM11PS2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM11CS" edc:desc="" edc:mask="0x7" edc:name="PWM11CS" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM11PS" edc:desc="" edc:mask="0x7" edc:name="PWM11PS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CS0" edc:desc="" edc:mask="0x1" edc:name="CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="" edc:mask="0x1" edc:name="CS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:desc="" edc:mask="0x1" edc:name="CS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PS0" edc:desc="" edc:mask="0x1" edc:name="PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS1" edc:desc="" edc:mask="0x1" edc:name="PS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS2" edc:desc="" edc:mask="0x1" edc:name="PS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nn" edc:cname="PWM11LDCON" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----00" edc:name="PWM11LDCON" edc:nzwidth="8" edc:por="00----00" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDBF">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LDS" edc:desc="" edc:mask="0x3" edc:name="LDS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LDT" edc:desc="" edc:mask="0x1" edc:name="LDT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LDA" edc:desc="" edc:mask="0x1" edc:name="LDA" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM11LDS0" edc:desc="" edc:mask="0x1" edc:name="PWM11LDS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM11LDS1" edc:desc="" edc:mask="0x1" edc:name="PWM11LDS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM11LDS" edc:desc="" edc:mask="0x3" edc:name="PWM11LDS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="PWM11LDM" edc:desc="" edc:mask="0x1" edc:name="PWM11LDM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM11LD" edc:desc="" edc:mask="0x1" edc:name="PWM11LD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="LDS0" edc:desc="" edc:mask="0x1" edc:name="LDS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LDS1" edc:desc="" edc:mask="0x1" edc:name="LDS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
